[NoCoverage] Statement mutation
Desktop/cshptests/Compute/Cube.cs:62:17
                 c.SetX(c.GetX() / 8.0);
                 c.SetY(c.GetY() / 8.0);
                 c.SetZ(c.GetZ() / 8.0);
-                center.Copy(c);
+                ;
             }
             return center; 

[Survived] Equality mutation
Desktop/cshptests/Compute/Cube.cs:91:21
 
             foreach (Point p in vertices)
             {
-                if (p.GetX() > bb.maxX) bb.maxX = p.GetX();
+                if (p.GetX() >= bb.maxX) bb.maxX = p.GetX();
                 if (p.GetX() < bb.minX) bb.minX = p.GetX();  
                 if (p.GetY() < bb.minY) bb.minY = p.GetY();

[Survived] Equality mutation
Desktop/cshptests/Compute/Cube.cs:92:21
             foreach (Point p in vertices)
             {
                 if (p.GetX() > bb.maxX) bb.maxX = p.GetX();
-                if (p.GetX() < bb.minX) bb.minX = p.GetX();  
+                if (p.GetX() <= bb.minX) bb.minX = p.GetX();  
                 if (p.GetY() < bb.minY) bb.minY = p.GetY();
                 if (p.GetY() > bb.maxY) bb.maxY = p.GetY();

[Survived] Equality mutation
Desktop/cshptests/Compute/Cube.cs:95:21
                 if (p.GetX() < bb.minX) bb.minX = p.GetX();  
                 if (p.GetY() < bb.minY) bb.minY = p.GetY();
                 if (p.GetY() > bb.maxY) bb.maxY = p.GetY();
-                if (p.GetZ() > bb.maxZ) bb.maxZ = p.GetZ();
+                if (p.GetZ() >= bb.maxZ) bb.maxZ = p.GetZ();
                 if (p.GetZ() < bb.minZ) bb.minZ = p.GetZ();
             }

[NoCoverage] Logical mutation
Desktop/cshptests/Compute/Cube.cs:106:20
         {
             BoundingBox? bb = this.GetBoundingBox();
 
-            return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
-                && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
+            return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
+                || p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
                 && p.GetZ() <= bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
         }

[NoCoverage] Logical mutation
Desktop/cshptests/Compute/Cube.cs:106:20
         {
             BoundingBox? bb = this.GetBoundingBox();
 
-            return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
+            return p.GetX() <= bb.Value.maxX || p.GetX() >= bb.Value.minX
                 && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
                 && p.GetZ() <= bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Cube.cs:108:20
 
             return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
                 && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
-                && p.GetZ() <= bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
+                && p.GetZ() < bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
         }
 

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Cube.cs:108:49
 
             return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
                 && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
-                && p.GetZ() <= bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
+                && p.GetZ() <= bb.Value.maxZ && p.GetZ() > bb.Value.minZ;
         }
 
