[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/Point.cs:18:37
         public double GetZ() { return z; }
 
         public void SetX(double nx) { x = nx; }
-        public void SetY(double ny) { x = ny; }
+        public void SetY(double ny) {}
         public void SetZ(double nz) { x = nz; }
 

[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/Point.cs:19:37
 
         public void SetX(double nx) { x = nx; }
         public void SetY(double ny) { x = ny; }
-        public void SetZ(double nz) { x = nz; }
+        public void SetZ(double nz) {}
 
         public static Point operator +(Point a, Point b)

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Point.cs:41:89
         // Distance between two points
         public static double operator %(Point a, Point b)
         {
-            return Math.Sqrt(Math.Pow(b.x - a.x, 2) + Math.Pow(b.y - a.y, 2) + Math.Pow(b.z - a.z, 2));
+            return Math.Sqrt(Math.Pow(b.x - a.x, 2) + Math.Pow(b.y - a.y, 2) + Math.Pow(b.z + a.z, 2));
         }
 
killedBy: Compute.Tests.CubeCreationVertexList

[NoCoverage] Logical mutation
Desktop/cshptests/Compute/Point.cs:47:21
         // Deep comparison
         public static bool operator ==(Point a, Point b)
         {
-            return (a.x == b.x && a.y == b.y && a.z == b.z);
+            return (a.x == b.x && a.y == b.y || a.z == b.z);
         }
 

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Point.cs:47:49
         // Deep comparison
         public static bool operator ==(Point a, Point b)
         {
-            return (a.x == b.x && a.y == b.y && a.z == b.z);
+            return (a.x == b.x && a.y == b.y && a.z != b.z);
         }
 
