[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:106:20
         {
             BoundingBox? bb = this.GetBoundingBox();
 
-            return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
+            return p.GetX() > bb.Value.maxX && p.GetX() >= bb.Value.minX
                 && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
                 && p.GetZ() <= bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
killedBy: Compute.Tests.BoundaryTesting; Compute.Tests.EquivalencePartitioning
