[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:31:34
                     figureName = "Single point";
                     break;
                 case 2:
-                    figureName = "Line";
+                    figureName = "";
                     break;
                 case 3:

[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:34:34
                     figureName = "Line";
                     break;
                 case 3:
-                    figureName = "Triangle ";
+                    figureName = "";
                     Triangle triangle = new Triangle(vertices[0], vertices[1], vertices[2]);
 

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:38:25
                     Triangle triangle = new Triangle(vertices[0], vertices[1], vertices[2]);
 
                     // Determine the exact triangle type
-                    if (triangle.IsEquilateral())
+                    if (!(triangle.IsEquilateral()))
                     {
                         figureName += "equilateral";

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:42:30
                     {
                         figureName += "equilateral";
                     }
-                    else if (triangle.IsIsosceles())
+                    else if (!(triangle.IsIsosceles()))
                     {
                         figureName += "isosceles";

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:51:25
                         figureName += "scalene";
                     }
 
-                    if (triangle.IsRightAngled())
+                    if (!(triangle.IsRightAngled()))
                     {
                         figureName += " right-angled";

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:55:30
                     {
                         figureName += " right-angled";
                     }
-                    else if (triangle.IsObtuse())
+                    else if (!(triangle.IsObtuse()))
                     {
                         figureName += " obtuse";

[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:62:34
 
                     break;
                 case 4:
-                    figureName = "Quadrilateral";
+                    figureName = "";
                     Quadrilateral quadrilateral = new Quadrilateral(vertices[0], vertices[1], vertices[2], vertices[3]);
 

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:66:25
                     Quadrilateral quadrilateral = new Quadrilateral(vertices[0], vertices[1], vertices[2], vertices[3]);
 
                     // Determine the exact quadrilateral type
-                    if (quadrilateral.IsTrapezoid())
+                    if (!(quadrilateral.IsTrapezoid()))
                     {
                         figureName = "Trapezoid";

[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:68:38
                     // Determine the exact quadrilateral type
                     if (quadrilateral.IsTrapezoid())
                     {
-                        figureName = "Trapezoid";
+                        figureName = "";
                     }
                     else if (quadrilateral.IsParallelogram())

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:70:30
                     {
                         figureName = "Trapezoid";
                     }
-                    else if (quadrilateral.IsParallelogram())
+                    else if (!(quadrilateral.IsParallelogram()))
                     {
                         figureName = "Parallelogram";

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:74:29
                     {
                         figureName = "Parallelogram";
                         
-                        if (quadrilateral.IsRectangle())
+                        if (!(quadrilateral.IsRectangle()))
                         {
                             figureName = "Rectangle";

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:78:33
                         {
                             figureName = "Rectangle";
 
-                            if (quadrilateral.IsSquare())
+                            if (!(quadrilateral.IsSquare()))
                             {
                                 figureName = "Square";

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:83:34
                                 figureName = "Square";
                             }
                         }
-                        else if (quadrilateral.IsRhombus())
+                        else if (!(quadrilateral.IsRhombus()))
                         {
                             figureName = "Rhombus";

[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:85:42
                         }
                         else if (quadrilateral.IsRhombus())
                         {
-                            figureName = "Rhombus";
+                            figureName = "";
                         }
                     }

[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:91:85
 
                     break;
                 default:
-                    figureName = "Unknown figure with " + noOfVertices.ToString() + " vertices";
+                    figureName = "Unknown figure with " + noOfVertices.ToString() + "";
                     break;
             }

[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:91:34
 
                     break;
                 default:
-                    figureName = "Unknown figure with " + noOfVertices.ToString() + " vertices";
+                    figureName = "" + noOfVertices.ToString() + " vertices";
                     break;
             }
