[Killed] Logical mutation
Desktop/cshptests/Compute/Quadrilateral.cs:43:34
 
         public void CheckOppositeSidesEqual()
         {
-            oppositeSidesEqual = Math.Abs(side1 - side2) < double.Epsilon &&
-               Math.Abs(side3 - side4) < double.Epsilon;
+            oppositeSidesEqual = Math.Abs(side1 - side2) < double.Epsilon ||
+               Math.Abs(side3 - side4) < double.Epsilon;
         }
 
killedBy: Compute.Tests.QuadriTests

[Killed] Logical mutation
Desktop/cshptests/Compute/Quadrilateral.cs:49:20
 
         public bool AreAllSidesEqual()
         {
-            return Math.Abs(side1 - side2) < double.Epsilon &&
-                   Math.Abs(side2 - side3) < double.Epsilon &&
-                   Math.Abs(side3 - side4) < double.Epsilon;
+            return Math.Abs(side1 - side2) < double.Epsilon &&
+                   Math.Abs(side2 - side3) < double.Epsilon ||
+                   Math.Abs(side3 - side4) < double.Epsilon;
         }
 
killedBy: Compute.Tests.QuadriTests
