[Killed] Logical mutation
Desktop/cshptests/Compute/Triangle.cs:28:20
 
         public bool IsEquilateral()
         {
-            return side1 == side2 && side2 == side3;
+            return side1 == side2 || side2 == side3;
         }
 
killedBy: Compute.Tests.TriangleTests

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Triangle.cs:47:64
         {
             double[] sides = { side1, side2, side3 };
             Array.Sort(sides);
-            return sides[0] * sides[0] + sides[1] * sides[1] < sides[2] * sides[2];
+            return sides[0] * sides[0] + sides[1] * sides[1] < sides[2] / sides[2];
         }
     }
killedBy: Compute.Tests.TriangleTests

[Killed] Equality mutation
Desktop/cshptests/Compute/Triangle.cs:47:20
         {
             double[] sides = { side1, side2, side3 };
             Array.Sort(sides);
-            return sides[0] * sides[0] + sides[1] * sides[1] < sides[2] * sides[2];
+            return sides[0] * sides[0] + sides[1] * sides[1] > sides[2] * sides[2];
         }
     }
killedBy: Compute.Tests.TriangleTests
