[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:28:34
             vertices = [];
 
             // lower face
-            Point A1 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
+            Point A1 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
             Point B1 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
             Point C1 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:28:49
             vertices = [];
 
             // lower face
-            Point A1 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
+            Point A1 = new Point(point.GetX() - length * 2, point.GetY() + length / 2, point.GetZ() - length / 2);
             Point B1 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
             Point C1 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:29:34
 
             // lower face
             Point A1 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
-            Point B1 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
+            Point B1 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
             Point C1 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
             Point D1 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:29:103
 
             // lower face
             Point A1 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
-            Point B1 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
+            Point B1 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() - length * 2);
             Point C1 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
             Point D1 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:30:103
             // lower face
             Point A1 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
             Point B1 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
-            Point C1 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
+            Point C1 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() - length * 2);
             Point D1 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
             
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:30:49
             // lower face
             Point A1 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
             Point B1 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
-            Point C1 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
+            Point C1 = new Point(point.GetX() + length * 2, point.GetY() - length / 2, point.GetZ() - length / 2);
             Point D1 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
             
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:31:88
             Point A1 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
             Point B1 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
             Point C1 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
-            Point D1 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
+            Point D1 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
             
             // upper face
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:31:34
             Point A1 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
             Point B1 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
             Point C1 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
-            Point D1 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
+            Point D1 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
             
             // upper face
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:34:76
             Point D1 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
             
             // upper face
-            Point A2 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
+            Point A2 = new Point(point.GetX() - length / 2, point.GetY() + length * 2, point.GetZ() + length / 2);
             Point B2 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
             Point C2 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:34:88
             Point D1 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
             
             // upper face
-            Point A2 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
+            Point A2 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() - length / 2);
             Point B2 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
             Point C2 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:35:61
             
             // upper face
             Point A2 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
-            Point B2 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
+            Point B2 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
             Point C2 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
             Point D2 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:35:76
             
             // upper face
             Point A2 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
-            Point B2 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
+            Point B2 = new Point(point.GetX() + length / 2, point.GetY() + length * 2, point.GetZ() + length / 2);
             Point C2 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
             Point D2 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:36:103
             // upper face
             Point A2 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
             Point B2 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
-            Point C2 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
+            Point C2 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() + length * 2);
             Point D2 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
 
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:36:88
             // upper face
             Point A2 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
             Point B2 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
-            Point C2 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
+            Point C2 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() - length / 2);
             Point D2 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
 
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:37:49
             Point A2 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
             Point B2 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
             Point C2 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
-            Point D2 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
+            Point D2 = new Point(point.GetX() - length * 2, point.GetY() - length / 2, point.GetZ() + length / 2);
 
             vertices.Add(A1);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:37:34
             Point A2 = new Point(point.GetX() - length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
             Point B2 = new Point(point.GetX() + length / 2, point.GetY() + length / 2, point.GetZ() + length / 2);
             Point C2 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
-            Point D2 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
+            Point D2 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
 
             vertices.Add(A1);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Statement mutation
Desktop/cshptests/Compute/Cube.cs:39:13
             Point C2 = new Point(point.GetX() + length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
             Point D2 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
 
-            vertices.Add(A1);
+            ;
             vertices.Add(A2);
             vertices.Add(B1);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Statement mutation
Desktop/cshptests/Compute/Cube.cs:40:13
             Point D2 = new Point(point.GetX() - length / 2, point.GetY() - length / 2, point.GetZ() + length / 2);
 
             vertices.Add(A1);
-            vertices.Add(A2);
+            ;
             vertices.Add(B1);
             vertices.Add(B2);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Statement mutation
Desktop/cshptests/Compute/Cube.cs:41:13
 
             vertices.Add(A1);
             vertices.Add(A2);
-            vertices.Add(B1);
+            ;
             vertices.Add(B2);
             vertices.Add(C1);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Statement mutation
Desktop/cshptests/Compute/Cube.cs:42:13
             vertices.Add(A1);
             vertices.Add(A2);
             vertices.Add(B1);
-            vertices.Add(B2);
+            ;
             vertices.Add(C1);
             vertices.Add(C2);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Statement mutation
Desktop/cshptests/Compute/Cube.cs:43:13
             vertices.Add(A2);
             vertices.Add(B1);
             vertices.Add(B2);
-            vertices.Add(C1);
+            ;
             vertices.Add(C2);
             vertices.Add(D1);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Statement mutation
Desktop/cshptests/Compute/Cube.cs:44:13
             vertices.Add(B1);
             vertices.Add(B2);
             vertices.Add(C1);
-            vertices.Add(C2);
+            ;
             vertices.Add(D1);
             vertices.Add(D2);
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Statement mutation
Desktop/cshptests/Compute/Cube.cs:45:13
             vertices.Add(B2);
             vertices.Add(C1);
             vertices.Add(C2);
-            vertices.Add(D1);
+            ;
             vertices.Add(D2);
         }
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Statement mutation
Desktop/cshptests/Compute/Cube.cs:46:13
             vertices.Add(C1);
             vertices.Add(C2);
             vertices.Add(D1);
-            vertices.Add(D2);
+            ;
         }
         public Cube(List<Point> points)
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Block removal mutation
Desktop/cshptests/Compute/Cube.cs:49:9
             vertices.Add(D2);
         }
         public Cube(List<Point> points)
-        {
-            this.vertices = points;
-        }
+        {}
 
         public List<Point>? GetVertices() { return vertices; }
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationVertexList; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Block removal mutation
Desktop/cshptests/Compute/Cube.cs:53:43
             this.vertices = points;
         }
 
-        public List<Point>? GetVertices() { return vertices; }
+        public List<Point>? GetVertices() {}
         public Point? GetCenter() 
         {
killedBy: Compute.Tests.CubeCreationCenter; Compute.Tests.CubeCreationVertexList

[Killed] Negate expression
Desktop/cshptests/Compute/Cube.cs:56:17
         public List<Point>? GetVertices() { return vertices; }
         public Point? GetCenter() 
         {
-            if (vertices != null && vertices.Count > 0)
+            if (!(vertices != null && vertices.Count > 0))
             {
                 Point c = vertices.Aggregate(new Point(0.0, 0.0, 0.0), (total, next) => total + next);
killedBy: Compute.Tests.NullCubeCreation

[Killed] Logical mutation
Desktop/cshptests/Compute/Cube.cs:56:17
         public List<Point>? GetVertices() { return vertices; }
         public Point? GetCenter() 
         {
-            if (vertices != null && vertices.Count > 0)
+            if (vertices != null || vertices.Count > 0)
             {
                 Point c = vertices.Aggregate(new Point(0.0, 0.0, 0.0), (total, next) => total + next);
killedBy: Compute.Tests.NullCubeCreation

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:59:24
             if (vertices != null && vertices.Count > 0)
             {
                 Point c = vertices.Aggregate(new Point(0.0, 0.0, 0.0), (total, next) => total + next);
-                c.SetX(c.GetX() / 8.0);
+                c.SetX(c.GetX() * 8.0);
                 c.SetY(c.GetY() / 8.0);
                 c.SetZ(c.GetZ() / 8.0);

[NoCoverage] Statement mutation
Desktop/cshptests/Compute/Cube.cs:59:17
             if (vertices != null && vertices.Count > 0)
             {
                 Point c = vertices.Aggregate(new Point(0.0, 0.0, 0.0), (total, next) => total + next);
-                c.SetX(c.GetX() / 8.0);
+                ;
                 c.SetY(c.GetY() / 8.0);
                 c.SetZ(c.GetZ() / 8.0);

[NoCoverage] Statement mutation
Desktop/cshptests/Compute/Cube.cs:60:17
             {
                 Point c = vertices.Aggregate(new Point(0.0, 0.0, 0.0), (total, next) => total + next);
                 c.SetX(c.GetX() / 8.0);
-                c.SetY(c.GetY() / 8.0);
+                ;
                 c.SetZ(c.GetZ() / 8.0);
                 if (center == null)

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:60:24
             {
                 Point c = vertices.Aggregate(new Point(0.0, 0.0, 0.0), (total, next) => total + next);
                 c.SetX(c.GetX() / 8.0);
-                c.SetY(c.GetY() / 8.0);
+                c.SetY(c.GetY() * 8.0);
                 c.SetZ(c.GetZ() / 8.0);
                 if (center == null)

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:61:24
                 Point c = vertices.Aggregate(new Point(0.0, 0.0, 0.0), (total, next) => total + next);
                 c.SetX(c.GetX() / 8.0);
                 c.SetY(c.GetY() / 8.0);
-                c.SetZ(c.GetZ() / 8.0);
+                c.SetZ(c.GetZ() * 8.0);
                 if (center == null)
                 {

[NoCoverage] Statement mutation
Desktop/cshptests/Compute/Cube.cs:61:17
                 Point c = vertices.Aggregate(new Point(0.0, 0.0, 0.0), (total, next) => total + next);
                 c.SetX(c.GetX() / 8.0);
                 c.SetY(c.GetY() / 8.0);
-                c.SetZ(c.GetZ() / 8.0);
+                ;
                 if (center == null)
                 {

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Cube.cs:62:21
                 c.SetX(c.GetX() / 8.0);
                 c.SetY(c.GetY() / 8.0);
                 c.SetZ(c.GetZ() / 8.0);
-                if (center == null)
+                if (center != null)
                 {
                     return center;

[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/Cube.cs:63:17
                 c.SetY(c.GetY() / 8.0);
                 c.SetZ(c.GetZ() / 8.0);
                 if (center == null)
-                {
-                    return center;
-                }
+                {}
                 center.Copy(c);
                 return center;

[NoCoverage] Statement mutation
Desktop/cshptests/Compute/Cube.cs:66:17
                 {
                     return center;
                 }
-                center.Copy(c);
+                ;
                 return center;
             }

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Desktop/cshptests/Compute/Cube.cs:73:17
         }
         public double GetEdgeLength() 
         {
-            if (!edgeLength.HasValue)
+            if (edgeLength.HasValue)
             {
                 if (vertices != null && vertices.Count > 0)
killedBy: Compute.Tests.CubeCreationVertexList; Compute.Tests.NullCubeCreation

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:75:21
         {
             if (!edgeLength.HasValue)
             {
-                if (vertices != null && vertices.Count > 0)
+                if (vertices == null && vertices.Count > 0)
                 {
                     edgeLength = vertices[1] % vertices[0];
killedBy: Compute.Tests.CubeCreationVertexList; Compute.Tests.NullCubeCreation

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Cube.cs:77:34
             {
                 if (vertices != null && vertices.Count > 0)
                 {
-                    edgeLength = vertices[1] % vertices[0];
+                    edgeLength = vertices[1] * vertices[0];
                 }
                 else 
killedBy: Compute.Tests.CubeCreationVertexList

[Killed] Block removal mutation
Desktop/cshptests/Compute/Cube.cs:80:17
                     edgeLength = vertices[1] % vertices[0];
                 }
                 else 
-                { 
-                    return 0.0;
-                }
+                {}
             }
             return edgeLength.Value;
killedBy: Compute.Tests.NullCubeCreation

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:89:17
 
         public BoundingBox? GetBoundingBox()
         {
-            if (vertices == null)
+            if (vertices != null)
                 return null;
 
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.CubeCreationVertexList

[Killed] Negate expression
Desktop/cshptests/Compute/Cube.cs:96:21
 
             foreach (Point p in vertices)
             {
-                if (p.GetX() > bb.maxX) bb.maxX = p.GetX();
+                if (!(p.GetX() > bb.maxX)) bb.maxX = p.GetX();
                 if (p.GetX() < bb.minX) bb.minX = p.GetX();  
                 if (p.GetY() < bb.minY) bb.minY = p.GetY();
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:96:21
 
             foreach (Point p in vertices)
             {
-                if (p.GetX() > bb.maxX) bb.maxX = p.GetX();
+                if (p.GetX() < bb.maxX) bb.maxX = p.GetX();
                 if (p.GetX() < bb.minX) bb.minX = p.GetX();  
                 if (p.GetY() < bb.minY) bb.minY = p.GetY();
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:97:21
             foreach (Point p in vertices)
             {
                 if (p.GetX() > bb.maxX) bb.maxX = p.GetX();
-                if (p.GetX() < bb.minX) bb.minX = p.GetX();  
+                if (p.GetX() > bb.minX) bb.minX = p.GetX();  
                 if (p.GetY() < bb.minY) bb.minY = p.GetY();
                 if (p.GetY() > bb.maxY) bb.maxY = p.GetY();
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Negate expression
Desktop/cshptests/Compute/Cube.cs:97:21
             foreach (Point p in vertices)
             {
                 if (p.GetX() > bb.maxX) bb.maxX = p.GetX();
-                if (p.GetX() < bb.minX) bb.minX = p.GetX();  
+                if (!(p.GetX() < bb.minX)) bb.minX = p.GetX();  
                 if (p.GetY() < bb.minY) bb.minY = p.GetY();
                 if (p.GetY() > bb.maxY) bb.maxY = p.GetY();
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Negate expression
Desktop/cshptests/Compute/Cube.cs:98:21
             {
                 if (p.GetX() > bb.maxX) bb.maxX = p.GetX();
                 if (p.GetX() < bb.minX) bb.minX = p.GetX();  
-                if (p.GetY() < bb.minY) bb.minY = p.GetY();
+                if (!(p.GetY() < bb.minY)) bb.minY = p.GetY();
                 if (p.GetY() > bb.maxY) bb.maxY = p.GetY();
                 if (p.GetZ() > bb.maxZ) bb.maxZ = p.GetZ();
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:98:21
             {
                 if (p.GetX() > bb.maxX) bb.maxX = p.GetX();
                 if (p.GetX() < bb.minX) bb.minX = p.GetX();  
-                if (p.GetY() < bb.minY) bb.minY = p.GetY();
+                if (p.GetY() > bb.minY) bb.minY = p.GetY();
                 if (p.GetY() > bb.maxY) bb.maxY = p.GetY();
                 if (p.GetZ() > bb.maxZ) bb.maxZ = p.GetZ();
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:99:21
                 if (p.GetX() > bb.maxX) bb.maxX = p.GetX();
                 if (p.GetX() < bb.minX) bb.minX = p.GetX();  
                 if (p.GetY() < bb.minY) bb.minY = p.GetY();
-                if (p.GetY() > bb.maxY) bb.maxY = p.GetY();
+                if (p.GetY() < bb.maxY) bb.maxY = p.GetY();
                 if (p.GetZ() > bb.maxZ) bb.maxZ = p.GetZ();
                 if (p.GetZ() < bb.minZ) bb.minZ = p.GetZ();
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Negate expression
Desktop/cshptests/Compute/Cube.cs:99:21
                 if (p.GetX() > bb.maxX) bb.maxX = p.GetX();
                 if (p.GetX() < bb.minX) bb.minX = p.GetX();  
                 if (p.GetY() < bb.minY) bb.minY = p.GetY();
-                if (p.GetY() > bb.maxY) bb.maxY = p.GetY();
+                if (!(p.GetY() > bb.maxY)) bb.maxY = p.GetY();
                 if (p.GetZ() > bb.maxZ) bb.maxZ = p.GetZ();
                 if (p.GetZ() < bb.minZ) bb.minZ = p.GetZ();
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:100:21
                 if (p.GetX() < bb.minX) bb.minX = p.GetX();  
                 if (p.GetY() < bb.minY) bb.minY = p.GetY();
                 if (p.GetY() > bb.maxY) bb.maxY = p.GetY();
-                if (p.GetZ() > bb.maxZ) bb.maxZ = p.GetZ();
+                if (p.GetZ() < bb.maxZ) bb.maxZ = p.GetZ();
                 if (p.GetZ() < bb.minZ) bb.minZ = p.GetZ();
             }
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Negate expression
Desktop/cshptests/Compute/Cube.cs:100:21
                 if (p.GetX() < bb.minX) bb.minX = p.GetX();  
                 if (p.GetY() < bb.minY) bb.minY = p.GetY();
                 if (p.GetY() > bb.maxY) bb.maxY = p.GetY();
-                if (p.GetZ() > bb.maxZ) bb.maxZ = p.GetZ();
+                if (!(p.GetZ() > bb.maxZ)) bb.maxZ = p.GetZ();
                 if (p.GetZ() < bb.minZ) bb.minZ = p.GetZ();
             }
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:101:21
                 if (p.GetY() < bb.minY) bb.minY = p.GetY();
                 if (p.GetY() > bb.maxY) bb.maxY = p.GetY();
                 if (p.GetZ() > bb.maxZ) bb.maxZ = p.GetZ();
-                if (p.GetZ() < bb.minZ) bb.minZ = p.GetZ();
+                if (p.GetZ() > bb.minZ) bb.minZ = p.GetZ();
             }
 
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Negate expression
Desktop/cshptests/Compute/Cube.cs:101:21
                 if (p.GetY() < bb.minY) bb.minY = p.GetY();
                 if (p.GetY() > bb.maxY) bb.maxY = p.GetY();
                 if (p.GetZ() > bb.maxZ) bb.maxZ = p.GetZ();
-                if (p.GetZ() < bb.minZ) bb.minZ = p.GetZ();
+                if (!(p.GetZ() < bb.minZ)) bb.minZ = p.GetZ();
             }
 
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:111:49
         {
             BoundingBox? bb = this.GetBoundingBox();
 
-            return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
+            return p.GetX() <= bb.Value.maxX && p.GetX() < bb.Value.minX
                 && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
                 && p.GetZ() <= bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Logical mutation
Desktop/cshptests/Compute/Cube.cs:111:20
         {
             BoundingBox? bb = this.GetBoundingBox();
 
-            return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
-                && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
-                && p.GetZ() <= bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
+            return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
+                && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
+                && p.GetZ() <= bb.Value.maxZ || p.GetZ() >= bb.Value.minZ;
         }
 
killedBy: Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:112:20
             BoundingBox? bb = this.GetBoundingBox();
 
             return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
-                && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
+                && p.GetY() > bb.Value.maxY && p.GetY() >= bb.Value.minY
                 && p.GetZ() <= bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
         }
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox
