[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:112:49
             BoundingBox? bb = this.GetBoundingBox();
 
             return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
-                && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
+                && p.GetY() <= bb.Value.maxY && p.GetY() < bb.Value.minY
                 && p.GetZ() <= bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
         }
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:113:20
 
             return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
                 && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
-                && p.GetZ() <= bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
+                && p.GetZ() > bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
         }
 
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:113:49
 
             return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
                 && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
-                && p.GetZ() <= bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
+                && p.GetZ() <= bb.Value.maxZ && p.GetZ() < bb.Value.minZ;
         }
 
killedBy: Compute.Tests.BoundaryTestingBoundingBox; Compute.Tests.CubeCreationCenter; Compute.Tests.EquivalencePartitioningBoundingBox
