[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:9:37
     public class FigureDecision
     {
         private List<Point> vertices;
-        private string figureName = "Not decided yet.";
+        private string figureName = "";
 
         public FigureDecision(List<Point> vertices)

[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/FigureDecision.cs:12:9
         private string figureName = "Not decided yet.";
 
         public FigureDecision(List<Point> vertices)
-        {
-            this.vertices = vertices;
-        }
+        {}
 
         public void ComputeFigureDecision() // line 1

[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:31:34
                     figureName = "Single point"; // line 8
                     break; // line 9
                 case 2: // line 10
-                    figureName = "Line"; // line 11
+                    figureName = ""; // line 11
                     break; // line 12
                 case 3: // line 13

[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:34:34
                     figureName = "Line"; // line 11
                     break; // line 12
                 case 3: // line 13
-                    figureName = "Triangle "; // line 14
+                    figureName = ""; // line 14
                     Triangle triangle = new Triangle(vertices[0], vertices[1], vertices[2]); // line 15
 

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:38:25
                     Triangle triangle = new Triangle(vertices[0], vertices[1], vertices[2]); // line 15
 
                     // Determine the exact triangle type
-                    if (triangle.IsEquilateral()) // line 16
+                    if (!(triangle.IsEquilateral())) // line 16
                     {
                         figureName += "equilateral"; // line 17

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:42:30
                     {
                         figureName += "equilateral"; // line 17
                     }
-                    else if (triangle.IsIsosceles()) // line 18
+                    else if (!(triangle.IsIsosceles())) // line 18
                     {
                         figureName += "isosceles"; // line 19

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:51:25
                         figureName += "scalene"; // line 21
                     }
 
-                    if (triangle.IsRightAngled()) // line 22
+                    if (!(triangle.IsRightAngled())) // line 22
                     {
                         figureName += " right-angled"; // line 23

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:55:30
                     {
                         figureName += " right-angled"; // line 23
                     }
-                    else if (triangle.IsObtuse()) // line 24
+                    else if (!(triangle.IsObtuse())) // line 24
                     {
                         figureName += " obtuse"; // line 25

[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:62:34
 
                     break; // line 26
                 case 4: // line 27
-                    figureName = "Quadrilateral"; // line 28
+                    figureName = ""; // line 28
                     Quadrilateral quadrilateral = new Quadrilateral(vertices[0], vertices[1], vertices[2], vertices[3]); // line 29
 

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:66:25
                     Quadrilateral quadrilateral = new Quadrilateral(vertices[0], vertices[1], vertices[2], vertices[3]); // line 29
 
                     // Determine the exact quadrilateral type
-                    if (quadrilateral.IsTrapezoid()) // line 30
+                    if (!(quadrilateral.IsTrapezoid())) // line 30
                     {
                         figureName = "Trapezoid"; // line 31

[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:68:38
                     // Determine the exact quadrilateral type
                     if (quadrilateral.IsTrapezoid()) // line 30
                     {
-                        figureName = "Trapezoid"; // line 31
+                        figureName = ""; // line 31
                     }
                     else if (quadrilateral.IsParallelogram()) // line 32

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:70:30
                     {
                         figureName = "Trapezoid"; // line 31
                     }
-                    else if (quadrilateral.IsParallelogram()) // line 32
+                    else if (!(quadrilateral.IsParallelogram())) // line 32
                     {
                         figureName = "Parallelogram"; // line 33

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:74:29
                     {
                         figureName = "Parallelogram"; // line 33
 
-                        if (quadrilateral.IsRectangle()) // line 34
+                        if (!(quadrilateral.IsRectangle())) // line 34
                         {
                             figureName = "Rectangle"; // line 35

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:78:33
                         {
                             figureName = "Rectangle"; // line 35
 
-                            if (quadrilateral.IsSquare()) // line 36
+                            if (!(quadrilateral.IsSquare())) // line 36
                             {
                                 figureName = "Square"; // line 37

[NoCoverage] Negate expression
Desktop/cshptests/Compute/FigureDecision.cs:83:34
                                 figureName = "Square"; // line 37
                             }
                         }
-                        else if (quadrilateral.IsRhombus()) // line 38
+                        else if (!(quadrilateral.IsRhombus())) // line 38
                         {
                             figureName = "Rhombus"; // line 39

[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:85:42
                         }
                         else if (quadrilateral.IsRhombus()) // line 38
                         {
-                            figureName = "Rhombus"; // line 39
+                            figureName = ""; // line 39
                         }
                     }

[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:91:85
 
                     break; // line 40
                 default: //41
-                    figureName = "Unknown figure with " + noOfVertices.ToString() + " vertices"; // line 42
+                    figureName = "Unknown figure with " + noOfVertices.ToString() + ""; // line 42
                     break; // line 43
             }

[NoCoverage] String mutation
Desktop/cshptests/Compute/FigureDecision.cs:91:34
 
                     break; // line 40
                 default: //41
-                    figureName = "Unknown figure with " + noOfVertices.ToString() + " vertices"; // line 42
+                    figureName = "" + noOfVertices.ToString() + " vertices"; // line 42
                     break; // line 43
             }

[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/FigureDecision.cs:96:39
             }
         }
 
-        public string GetFigureName() { return figureName; }
+        public string GetFigureName() {}
     }
 }
