[Killed] Block removal mutation
Desktop/cshptests/Compute/Point.cs:7:9
     {
         public double x, y, z;
         public Point(double x, double y, double z)
-        {
-            this.x = x;
-            this.y = y;
-            this.z = z;
-        }
+        {}
 
         public double GetX() { return x; }
killedBy: Compute.Tests.BoundaryTestingDistance; Compute.Tests.CubeCreationVertexList; Compute.Tests.DotProductTest

[Killed] Block removal mutation
Desktop/cshptests/Compute/Point.cs:13:30
             this.z = z;
         }
 
-        public double GetX() { return x; }
+        public double GetX() {}
         public double GetY() { return y; }
         public double GetZ() { return z; }
killedBy: Compute.Tests.BoundaryTestingDistance; Compute.Tests.EquivalencePartitioningDistance; Compute.Tests.PointCreation

[Killed] Block removal mutation
Desktop/cshptests/Compute/Point.cs:14:30
         }
 
         public double GetX() { return x; }
-        public double GetY() { return y; }
+        public double GetY() {}
         public double GetZ() { return z; }
 
killedBy: Compute.Tests.BoundaryTestingDistance; Compute.Tests.EquivalencePartitioningDistance; Compute.Tests.PointCreation

[Killed] Block removal mutation
Desktop/cshptests/Compute/Point.cs:15:30
 
         public double GetX() { return x; }
         public double GetY() { return y; }
-        public double GetZ() { return z; }
+        public double GetZ() {}
 
         public void SetX(double nx) { x = nx; }
killedBy: Compute.Tests.EquivalencePartitioningDistance; Compute.Tests.PointCreation

[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/Point.cs:17:37
         public double GetY() { return y; }
         public double GetZ() { return z; }
 
-        public void SetX(double nx) { x = nx; }
+        public void SetX(double nx) {}
         public void SetY(double ny) { y = ny; }
         public void SetZ(double nz) { z = nz; }

[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/Point.cs:18:37
         public double GetZ() { return z; }
 
         public void SetX(double nx) { x = nx; }
-        public void SetY(double ny) { y = ny; }
+        public void SetY(double ny) {}
         public void SetZ(double nz) { z = nz; }
 

[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/Point.cs:19:37
 
         public void SetX(double nx) { x = nx; }
         public void SetY(double ny) { y = ny; }
-        public void SetZ(double nz) { z = nz; }
+        public void SetZ(double nz) {}
 
         public static Point operator +(Point a, Point b)

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Point.cs:23:41
 
         public static Point operator +(Point a, Point b)
         {
-            return new Point(a.x + b.x, a.y + b.y, a.z + b.z);
+            return new Point(a.x + b.x, a.y - b.y, a.z + b.z);
         }
 

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Point.cs:23:30
 
         public static Point operator +(Point a, Point b)
         {
-            return new Point(a.x + b.x, a.y + b.y, a.z + b.z);
+            return new Point(a.x - b.x, a.y + b.y, a.z + b.z);
         }
 

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Point.cs:28:20
 
         public static double operator * (Point a, Point b)
         {
-            return a.x * b.x + a.y * b.y + a.z * b.z;
+            return a.x * b.x + a.y * b.y - a.z * b.z;
         }
 
killedBy: Compute.Tests.DotProductTest

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Point.cs:28:20
 
         public static double operator * (Point a, Point b)
         {
-            return a.x * b.x + a.y * b.y + a.z * b.z;
+            return a.x * b.x - a.y * b.y + a.z * b.z;
         }
 
killedBy: Compute.Tests.DotProductTest

[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/Point.cs:32:9
         }
 
         public void Copy(Point toCopy)
-        {
-            x = toCopy.x;
-            y = toCopy.y;
-            z = toCopy.z;
-        }
+        {}
 
         // Distance between two points

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Point.cs:41:39
         // Distance between two points
         public static double operator %(Point a, Point b)
         {
-            return Math.Sqrt(Math.Pow(b.x - a.x, 2) + Math.Pow(b.y - a.y, 2) + Math.Pow(b.z - a.z, 2));
+            return Math.Sqrt(Math.Pow(b.x + a.x, 2) + Math.Pow(b.y - a.y, 2) + Math.Pow(b.z - a.z, 2));
         }
 
killedBy: Compute.Tests.BoundaryTestingDistance

[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Point.cs:41:30
         // Distance between two points
         public static double operator %(Point a, Point b)
         {
-            return Math.Sqrt(Math.Pow(b.x - a.x, 2) + Math.Pow(b.y - a.y, 2) + Math.Pow(b.z - a.z, 2));
+            return Math.Sqrt(Math.Pow(b.x - a.x, 2) - Math.Pow(b.y - a.y, 2) + Math.Pow(b.z - a.z, 2));
         }
 
killedBy: Compute.Tests.BoundaryTestingDistance; Compute.Tests.EquivalencePartitioningDistance

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Point.cs:47:53
         // Deep comparison
         public static bool operator ==(Point a, Point b)
         {
-            return (a.x == b.x) && (a.y == b.y) && (a.z == b.z);
+            return (a.x == b.x) && (a.y == b.y) && (a.z != b.z);
         }
 

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Point.cs:47:37
         // Deep comparison
         public static bool operator ==(Point a, Point b)
         {
-            return (a.x == b.x) && (a.y == b.y) && (a.z == b.z);
+            return (a.x == b.x) && (a.y != b.y) && (a.z == b.z);
         }
 

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Point.cs:52:22
 
         public static bool operator !=(Point a, Point b)
         {
-            return !(a == b);
+            return !(a != b);
         }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Desktop/cshptests/Compute/Point.cs:52:20
 
         public static bool operator !=(Point a, Point b)
         {
-            return !(a == b);
+            return (a == b);
         }
 

[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/Point.cs:56:9
         }
 
         public override int GetHashCode()
-        {
-            return HashCode.Combine(x, y, z);
-        }
+        {}
 
         public override bool Equals(object obj)

[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/Point.cs:61:9
         }
 
         public override bool Equals(object obj)
-        {
-            return this.Equals(obj as Point);
-        }
+        {}
 
         public bool Equals(Point? other)

[Killed] Equality mutation
Desktop/cshptests/Compute/Point.cs:67:26
 
         public bool Equals(Point? other)
         {
-            if (other is null) return false;
+            if (other is not null) return false;
 
             if (Object.ReferenceEquals(this, other)) return true;
killedBy: Compute.Tests.CubeCreationCenter

[Survived] Negate expression
Desktop/cshptests/Compute/Point.cs:69:17
         {
             if (other is null) return false;
 
-            if (Object.ReferenceEquals(this, other)) return true;
+            if (!(Object.ReferenceEquals(this, other))) return true;
             
             if (this.GetType() != other.GetType()) return false;

[NoCoverage] Boolean mutation
Desktop/cshptests/Compute/Point.cs:69:61
         {
             if (other is null) return false;
 
-            if (Object.ReferenceEquals(this, other)) return true;
+            if (Object.ReferenceEquals(this, other)) return false;
             
             if (this.GetType() != other.GetType()) return false;

[Killed] Equality mutation
Desktop/cshptests/Compute/Point.cs:71:17
 
             if (Object.ReferenceEquals(this, other)) return true;
             
-            if (this.GetType() != other.GetType()) return false;
+            if (this.GetType() == other.GetType()) return false;
 
 
killedBy: Compute.Tests.CubeCreationCenter

[NoCoverage] Boolean mutation
Desktop/cshptests/Compute/Point.cs:71:59
 
             if (Object.ReferenceEquals(this, other)) return true;
             
-            if (this.GetType() != other.GetType()) return false;
+            if (this.GetType() != other.GetType()) return true;
 
 

[Killed] Equality mutation
Desktop/cshptests/Compute/Point.cs:74:39
             if (this.GetType() != other.GetType()) return false;
 
 
-            return (x == other.x) && (y == other.y) && (z == other.z); 
+            return (x == other.x) && (y != other.y) && (z == other.z); 
 
         }
killedBy: Compute.Tests.CubeCreationCenter

[Killed] Equality mutation
Desktop/cshptests/Compute/Point.cs:74:21
             if (this.GetType() != other.GetType()) return false;
 
 
-            return (x == other.x) && (y == other.y) && (z == other.z); 
+            return (x != other.x) && (y == other.y) && (z == other.z); 
 
         }
killedBy: Compute.Tests.CubeCreationCenter
