[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/Quadrilateral.cs:22:9
         private bool oppositeSidesEqual;
 
         public Quadrilateral(Point point1, Point point2, Point point3, Point point4)
-        {
-            this.vertice1 = point1;
-            this.vertice2 = point2;
-            this.vertice3 = point3;
-            this.vertice4 = point4;
-
-            this.side1 = Utilities.Distance(vertice1, vertice2);
-            this.side2 = Utilities.Distance(vertice2, vertice3);
-            this.side3 = Utilities.Distance(vertice3, vertice4);
-            this.side4 = Utilities.Distance(vertice4, vertice1);
-        }
+        {}
 
         public void CheckParallelSides()

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:43:34
 
         public void CheckOppositeSidesEqual()
         {
-            oppositeSidesEqual = Math.Abs(side1 - side2) < double.Epsilon &&
+            oppositeSidesEqual = Math.Abs(side1 - side2) > double.Epsilon &&
                Math.Abs(side3 - side4) < double.Epsilon;
         }

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:43:34
 
         public void CheckOppositeSidesEqual()
         {
-            oppositeSidesEqual = Math.Abs(side1 - side2) < double.Epsilon &&
+            oppositeSidesEqual = Math.Abs(side1 - side2) <= double.Epsilon &&
                Math.Abs(side3 - side4) < double.Epsilon;
         }

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Quadrilateral.cs:44:25
         public void CheckOppositeSidesEqual()
         {
             oppositeSidesEqual = Math.Abs(side1 - side2) < double.Epsilon &&
-               Math.Abs(side3 - side4) < double.Epsilon;
+               Math.Abs(side3 + side4) < double.Epsilon;
         }
 

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:44:16
         public void CheckOppositeSidesEqual()
         {
             oppositeSidesEqual = Math.Abs(side1 - side2) < double.Epsilon &&
-               Math.Abs(side3 - side4) < double.Epsilon;
+               Math.Abs(side3 - side4) > double.Epsilon;
         }
 

[NoCoverage] Logical mutation
Desktop/cshptests/Compute/Quadrilateral.cs:49:20
 
         public bool AreAllSidesEqual()
         {
-            return Math.Abs(side1 - side2) < double.Epsilon &&
-                   Math.Abs(side2 - side3) < double.Epsilon &&
+            return Math.Abs(side1 - side2) < double.Epsilon ||
+                   Math.Abs(side2 - side3) < double.Epsilon &&
                    Math.Abs(side3 - side4) < double.Epsilon;
         }

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:49:20
 
         public bool AreAllSidesEqual()
         {
-            return Math.Abs(side1 - side2) < double.Epsilon &&
+            return Math.Abs(side1 - side2) <= double.Epsilon &&
                    Math.Abs(side2 - side3) < double.Epsilon &&
                    Math.Abs(side3 - side4) < double.Epsilon;

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:50:20
         public bool AreAllSidesEqual()
         {
             return Math.Abs(side1 - side2) < double.Epsilon &&
-                   Math.Abs(side2 - side3) < double.Epsilon &&
+                   Math.Abs(side2 - side3) <= double.Epsilon &&
                    Math.Abs(side3 - side4) < double.Epsilon;
         }

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:50:20
         public bool AreAllSidesEqual()
         {
             return Math.Abs(side1 - side2) < double.Epsilon &&
-                   Math.Abs(side2 - side3) < double.Epsilon &&
+                   Math.Abs(side2 - side3) > double.Epsilon &&
                    Math.Abs(side3 - side4) < double.Epsilon;
         }

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:51:20
         {
             return Math.Abs(side1 - side2) < double.Epsilon &&
                    Math.Abs(side2 - side3) < double.Epsilon &&
-                   Math.Abs(side3 - side4) < double.Epsilon;
+                   Math.Abs(side3 - side4) <= double.Epsilon;
         }
 

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:51:20
         {
             return Math.Abs(side1 - side2) < double.Epsilon &&
                    Math.Abs(side2 - side3) < double.Epsilon &&
-                   Math.Abs(side3 - side4) < double.Epsilon;
+                   Math.Abs(side3 - side4) > double.Epsilon;
         }
 

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Quadrilateral.cs:56:43
 
         public bool AreAllAngles90Degrees()
         {
-            Point side1Vector = new Point(vertice2.GetX() - vertice1.GetX(), vertice2.GetY() - vertice1.GetY(), vertice2.GetZ() - vertice1.GetZ());
+            Point side1Vector = new Point(vertice2.GetX() + vertice1.GetX(), vertice2.GetY() - vertice1.GetY(), vertice2.GetZ() - vertice1.GetZ());
             Point side2Vector = new Point(vertice3.GetX() - vertice2.GetX(), vertice3.GetY() - vertice2.GetY(), vertice3.GetZ() - vertice2.GetZ());
             Point side3Vector = new Point(vertice4.GetX() - vertice3.GetX(), vertice4.GetY() - vertice3.GetY(), vertice4.GetZ() - vertice3.GetZ());

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Quadrilateral.cs:56:113
 
         public bool AreAllAngles90Degrees()
         {
-            Point side1Vector = new Point(vertice2.GetX() - vertice1.GetX(), vertice2.GetY() - vertice1.GetY(), vertice2.GetZ() - vertice1.GetZ());
+            Point side1Vector = new Point(vertice2.GetX() - vertice1.GetX(), vertice2.GetY() - vertice1.GetY(), vertice2.GetZ() + vertice1.GetZ());
             Point side2Vector = new Point(vertice3.GetX() - vertice2.GetX(), vertice3.GetY() - vertice2.GetY(), vertice3.GetZ() - vertice2.GetZ());
             Point side3Vector = new Point(vertice4.GetX() - vertice3.GetX(), vertice4.GetY() - vertice3.GetY(), vertice4.GetZ() - vertice3.GetZ());

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Quadrilateral.cs:57:113
         public bool AreAllAngles90Degrees()
         {
             Point side1Vector = new Point(vertice2.GetX() - vertice1.GetX(), vertice2.GetY() - vertice1.GetY(), vertice2.GetZ() - vertice1.GetZ());
-            Point side2Vector = new Point(vertice3.GetX() - vertice2.GetX(), vertice3.GetY() - vertice2.GetY(), vertice3.GetZ() - vertice2.GetZ());
+            Point side2Vector = new Point(vertice3.GetX() - vertice2.GetX(), vertice3.GetY() - vertice2.GetY(), vertice3.GetZ() + vertice2.GetZ());
             Point side3Vector = new Point(vertice4.GetX() - vertice3.GetX(), vertice4.GetY() - vertice3.GetY(), vertice4.GetZ() - vertice3.GetZ());
             Point side4Vector = new Point(vertice1.GetX() - vertice4.GetX(), vertice1.GetY() - vertice4.GetY(), vertice1.GetZ() - vertice4.GetZ());

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Quadrilateral.cs:57:43
         public bool AreAllAngles90Degrees()
         {
             Point side1Vector = new Point(vertice2.GetX() - vertice1.GetX(), vertice2.GetY() - vertice1.GetY(), vertice2.GetZ() - vertice1.GetZ());
-            Point side2Vector = new Point(vertice3.GetX() - vertice2.GetX(), vertice3.GetY() - vertice2.GetY(), vertice3.GetZ() - vertice2.GetZ());
+            Point side2Vector = new Point(vertice3.GetX() + vertice2.GetX(), vertice3.GetY() - vertice2.GetY(), vertice3.GetZ() - vertice2.GetZ());
             Point side3Vector = new Point(vertice4.GetX() - vertice3.GetX(), vertice4.GetY() - vertice3.GetY(), vertice4.GetZ() - vertice3.GetZ());
             Point side4Vector = new Point(vertice1.GetX() - vertice4.GetX(), vertice1.GetY() - vertice4.GetY(), vertice1.GetZ() - vertice4.GetZ());

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Quadrilateral.cs:58:43
         {
             Point side1Vector = new Point(vertice2.GetX() - vertice1.GetX(), vertice2.GetY() - vertice1.GetY(), vertice2.GetZ() - vertice1.GetZ());
             Point side2Vector = new Point(vertice3.GetX() - vertice2.GetX(), vertice3.GetY() - vertice2.GetY(), vertice3.GetZ() - vertice2.GetZ());
-            Point side3Vector = new Point(vertice4.GetX() - vertice3.GetX(), vertice4.GetY() - vertice3.GetY(), vertice4.GetZ() - vertice3.GetZ());
+            Point side3Vector = new Point(vertice4.GetX() + vertice3.GetX(), vertice4.GetY() - vertice3.GetY(), vertice4.GetZ() - vertice3.GetZ());
             Point side4Vector = new Point(vertice1.GetX() - vertice4.GetX(), vertice1.GetY() - vertice4.GetY(), vertice1.GetZ() - vertice4.GetZ());
 

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Quadrilateral.cs:58:113
         {
             Point side1Vector = new Point(vertice2.GetX() - vertice1.GetX(), vertice2.GetY() - vertice1.GetY(), vertice2.GetZ() - vertice1.GetZ());
             Point side2Vector = new Point(vertice3.GetX() - vertice2.GetX(), vertice3.GetY() - vertice2.GetY(), vertice3.GetZ() - vertice2.GetZ());
-            Point side3Vector = new Point(vertice4.GetX() - vertice3.GetX(), vertice4.GetY() - vertice3.GetY(), vertice4.GetZ() - vertice3.GetZ());
+            Point side3Vector = new Point(vertice4.GetX() - vertice3.GetX(), vertice4.GetY() - vertice3.GetY(), vertice4.GetZ() + vertice3.GetZ());
             Point side4Vector = new Point(vertice1.GetX() - vertice4.GetX(), vertice1.GetY() - vertice4.GetY(), vertice1.GetZ() - vertice4.GetZ());
 

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Quadrilateral.cs:59:43
             Point side1Vector = new Point(vertice2.GetX() - vertice1.GetX(), vertice2.GetY() - vertice1.GetY(), vertice2.GetZ() - vertice1.GetZ());
             Point side2Vector = new Point(vertice3.GetX() - vertice2.GetX(), vertice3.GetY() - vertice2.GetY(), vertice3.GetZ() - vertice2.GetZ());
             Point side3Vector = new Point(vertice4.GetX() - vertice3.GetX(), vertice4.GetY() - vertice3.GetY(), vertice4.GetZ() - vertice3.GetZ());
-            Point side4Vector = new Point(vertice1.GetX() - vertice4.GetX(), vertice1.GetY() - vertice4.GetY(), vertice1.GetZ() - vertice4.GetZ());
+            Point side4Vector = new Point(vertice1.GetX() + vertice4.GetX(), vertice1.GetY() - vertice4.GetY(), vertice1.GetZ() - vertice4.GetZ());
 
             double dotProduct1 = Utilities.DotProduct(side1Vector, side2Vector);

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Quadrilateral.cs:59:78
             Point side1Vector = new Point(vertice2.GetX() - vertice1.GetX(), vertice2.GetY() - vertice1.GetY(), vertice2.GetZ() - vertice1.GetZ());
             Point side2Vector = new Point(vertice3.GetX() - vertice2.GetX(), vertice3.GetY() - vertice2.GetY(), vertice3.GetZ() - vertice2.GetZ());
             Point side3Vector = new Point(vertice4.GetX() - vertice3.GetX(), vertice4.GetY() - vertice3.GetY(), vertice4.GetZ() - vertice3.GetZ());
-            Point side4Vector = new Point(vertice1.GetX() - vertice4.GetX(), vertice1.GetY() - vertice4.GetY(), vertice1.GetZ() - vertice4.GetZ());
+            Point side4Vector = new Point(vertice1.GetX() - vertice4.GetX(), vertice1.GetY() + vertice4.GetY(), vertice1.GetZ() - vertice4.GetZ());
 
             double dotProduct1 = Utilities.DotProduct(side1Vector, side2Vector);

[NoCoverage] Logical mutation
Desktop/cshptests/Compute/Quadrilateral.cs:66:20
             double dotProduct3 = Utilities.DotProduct(side3Vector, side4Vector);
             double dotProduct4 = Utilities.DotProduct(side4Vector, side1Vector);
 
-            return Math.Abs(dotProduct1) < double.Epsilon &&
-                Math.Abs(dotProduct2) < double.Epsilon &&
-                Math.Abs(dotProduct3) < double.Epsilon &&
-                Math.Abs(dotProduct4) < double.Epsilon;
+            return Math.Abs(dotProduct1) < double.Epsilon &&
+                Math.Abs(dotProduct2) < double.Epsilon &&
+                Math.Abs(dotProduct3) < double.Epsilon ||
+                Math.Abs(dotProduct4) < double.Epsilon;
         }
 

[NoCoverage] Logical mutation
Desktop/cshptests/Compute/Quadrilateral.cs:66:20
             double dotProduct3 = Utilities.DotProduct(side3Vector, side4Vector);
             double dotProduct4 = Utilities.DotProduct(side4Vector, side1Vector);
 
-            return Math.Abs(dotProduct1) < double.Epsilon &&
-                Math.Abs(dotProduct2) < double.Epsilon &&
-                Math.Abs(dotProduct3) < double.Epsilon &&
+            return Math.Abs(dotProduct1) < double.Epsilon &&
+                Math.Abs(dotProduct2) < double.Epsilon ||
+                Math.Abs(dotProduct3) < double.Epsilon &&
                 Math.Abs(dotProduct4) < double.Epsilon;
         }

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:67:17
             double dotProduct4 = Utilities.DotProduct(side4Vector, side1Vector);
 
             return Math.Abs(dotProduct1) < double.Epsilon &&
-                Math.Abs(dotProduct2) < double.Epsilon &&
+                Math.Abs(dotProduct2) <= double.Epsilon &&
                 Math.Abs(dotProduct3) < double.Epsilon &&
                 Math.Abs(dotProduct4) < double.Epsilon;

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:67:17
             double dotProduct4 = Utilities.DotProduct(side4Vector, side1Vector);
 
             return Math.Abs(dotProduct1) < double.Epsilon &&
-                Math.Abs(dotProduct2) < double.Epsilon &&
+                Math.Abs(dotProduct2) > double.Epsilon &&
                 Math.Abs(dotProduct3) < double.Epsilon &&
                 Math.Abs(dotProduct4) < double.Epsilon;

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:68:17
 
             return Math.Abs(dotProduct1) < double.Epsilon &&
                 Math.Abs(dotProduct2) < double.Epsilon &&
-                Math.Abs(dotProduct3) < double.Epsilon &&
+                Math.Abs(dotProduct3) > double.Epsilon &&
                 Math.Abs(dotProduct4) < double.Epsilon;
         }

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:68:17
 
             return Math.Abs(dotProduct1) < double.Epsilon &&
                 Math.Abs(dotProduct2) < double.Epsilon &&
-                Math.Abs(dotProduct3) < double.Epsilon &&
+                Math.Abs(dotProduct3) <= double.Epsilon &&
                 Math.Abs(dotProduct4) < double.Epsilon;
         }

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:69:17
             return Math.Abs(dotProduct1) < double.Epsilon &&
                 Math.Abs(dotProduct2) < double.Epsilon &&
                 Math.Abs(dotProduct3) < double.Epsilon &&
-                Math.Abs(dotProduct4) < double.Epsilon;
+                Math.Abs(dotProduct4) <= double.Epsilon;
         }
 

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Quadrilateral.cs:69:17
             return Math.Abs(dotProduct1) < double.Epsilon &&
                 Math.Abs(dotProduct2) < double.Epsilon &&
                 Math.Abs(dotProduct3) < double.Epsilon &&
-                Math.Abs(dotProduct4) < double.Epsilon;
+                Math.Abs(dotProduct4) > double.Epsilon;
         }
 

[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/Quadrilateral.cs:73:9
         }
 
         public bool IsTrapezoid()
-        {
-            return sidesParallel;
-        }
+        {}
 
         public bool IsParallelogram()

[NoCoverage] Logical mutation
Desktop/cshptests/Compute/Quadrilateral.cs:79:20
 
         public bool IsParallelogram()
         {
-            return sidesParallel && oppositeSidesEqual;
+            return sidesParallel || oppositeSidesEqual;
         }
 

[NoCoverage] Logical mutation
Desktop/cshptests/Compute/Quadrilateral.cs:84:20
 
         public bool IsRectangle()
         {
-            return IsParallelogram() && AreAllAngles90Degrees();
+            return IsParallelogram() || AreAllAngles90Degrees();
         }
 

[NoCoverage] Logical mutation
Desktop/cshptests/Compute/Quadrilateral.cs:89:20
 
         public bool IsSquare()
         {
-            return IsRectangle() && AreAllSidesEqual();
+            return IsRectangle() || AreAllSidesEqual();
         }
 

[NoCoverage] Logical mutation
Desktop/cshptests/Compute/Quadrilateral.cs:94:20
 
         public bool IsRhombus()
         {
-            return AreAllSidesEqual() && sidesParallel;
+            return AreAllSidesEqual() || sidesParallel;
         }
     }
