[NoCoverage] Block removal mutation
Desktop/cshptests/Compute/Triangle.cs:16:9
         private double side3;
 
         public Triangle(Point point1, Point point2, Point point3) 
-        {
-            this.vertice1 = point1;
-            this.vertice2 = point2;
-            this.vertice3 = point3;
-
-            this.side1 = Utilities.Distance(vertice1, vertice2);
-            this.side2 = Utilities.Distance(vertice2, vertice3);
-            this.side3 = Utilities.Distance(vertice3, vertice1);
-        }
+        {}
 
         public bool IsEquilateral()

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Triangle.cs:28:20
 
         public bool IsEquilateral()
         {
-            return side1 == side2 && side2 == side3;
+            return side1 != side2 && side2 == side3;
         }
 

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Triangle.cs:28:38
 
         public bool IsEquilateral()
         {
-            return side1 == side2 && side2 == side3;
+            return side1 == side2 && side2 != side3;
         }
 

[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Triangle.cs:33:38
 
         public bool IsIsosceles()
         {
-            return side1 == side2 || side1 == side3 || side2 == side3;
+            return side1 == side2 || side1 != side3 || side2 == side3;
         }
 

[NoCoverage] Logical mutation
Desktop/cshptests/Compute/Triangle.cs:33:20
 
         public bool IsIsosceles()
         {
-            return side1 == side2 || side1 == side3 || side2 == side3;
+            return side1 == side2 || side1 == side3 && side2 == side3;
         }
 

[NoCoverage] Statement mutation
Desktop/cshptests/Compute/Triangle.cs:39:13
         public bool IsRightAngled()
         {
             double[] sides = { side1, side2, side3 };
-            Array.Sort(sides);
+            ;
             return Math.Abs(sides[0] * sides[0] + sides[1] * sides[1] - sides[2] * sides[2]) < 0.0001;
         }

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Triangle.cs:40:73
         {
             double[] sides = { side1, side2, side3 };
             Array.Sort(sides);
-            return Math.Abs(sides[0] * sides[0] + sides[1] * sides[1] - sides[2] * sides[2]) < 0.0001;
+            return Math.Abs(sides[0] * sides[0] + sides[1] * sides[1] - sides[2] / sides[2]) < 0.0001;
         }
 

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Triangle.cs:40:29
         {
             double[] sides = { side1, side2, side3 };
             Array.Sort(sides);
-            return Math.Abs(sides[0] * sides[0] + sides[1] * sides[1] - sides[2] * sides[2]) < 0.0001;
+            return Math.Abs(sides[0] / sides[0] + sides[1] * sides[1] - sides[2] * sides[2]) < 0.0001;
         }
 

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Triangle.cs:47:20
         {
             double[] sides = { side1, side2, side3 };
             Array.Sort(sides);
-            return sides[0] * sides[0] + sides[1] * sides[1] < sides[2] * sides[2];
+            return sides[0] * sides[0] - sides[1] * sides[1] < sides[2] * sides[2];
         }
     }

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Triangle.cs:47:42
         {
             double[] sides = { side1, side2, side3 };
             Array.Sort(sides);
-            return sides[0] * sides[0] + sides[1] * sides[1] < sides[2] * sides[2];
+            return sides[0] * sides[0] + sides[1] / sides[1] < sides[2] * sides[2];
         }
     }
