[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Utilities.cs:10:25
     {
         public static double Distance(Point p1, Point p2)
         {
-            double dx = p1.GetX() - p2.GetX();
+            double dx = p1.GetX() + p2.GetX();
             double dy = p1.GetY() - p2.GetY();
             double dz = p1.GetZ() - p2.GetZ();

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Utilities.cs:11:25
         public static double Distance(Point p1, Point p2)
         {
             double dx = p1.GetX() - p2.GetX();
-            double dy = p1.GetY() - p2.GetY();
+            double dy = p1.GetY() + p2.GetY();
             double dz = p1.GetZ() - p2.GetZ();
 

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Utilities.cs:12:25
         {
             double dx = p1.GetX() - p2.GetX();
             double dy = p1.GetY() - p2.GetY();
-            double dz = p1.GetZ() - p2.GetZ();
+            double dz = p1.GetZ() + p2.GetZ();
 
             return Math.Sqrt(dx * dx + dy * dy + dz * dz);

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Utilities.cs:14:30
             double dy = p1.GetY() - p2.GetY();
             double dz = p1.GetZ() - p2.GetZ();
 
-            return Math.Sqrt(dx * dx + dy * dy + dz * dz);
+            return Math.Sqrt(dx * dx - dy * dy + dz * dz);
         }
 

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Utilities.cs:14:40
             double dy = p1.GetY() - p2.GetY();
             double dz = p1.GetZ() - p2.GetZ();
 
-            return Math.Sqrt(dx * dx + dy * dy + dz * dz);
+            return Math.Sqrt(dx * dx + dy / dy + dz * dz);
         }
 

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Utilities.cs:19:44
 
         public static double DotProduct(Point v1, Point v2)
         {
-            return v1.GetX() * v2.GetX() + v1.GetY() * v2.GetY() + v1.GetZ() * v2.GetZ();
+            return v1.GetX() * v2.GetX() + v1.GetY() / v2.GetY() + v1.GetZ() * v2.GetZ();
         }
     }

[NoCoverage] Arithmetic mutation
Desktop/cshptests/Compute/Utilities.cs:19:20
 
         public static double DotProduct(Point v1, Point v2)
         {
-            return v1.GetX() * v2.GetX() + v1.GetY() * v2.GetY() + v1.GetZ() * v2.GetZ();
+            return v1.GetX() * v2.GetX() + v1.GetY() * v2.GetY() - v1.GetZ() * v2.GetZ();
         }
     }
