[NoCoverage] Equality mutation
Desktop/cshptests/Compute/Cube.cs:56:37
         public List<Point>? GetVertices() { return vertices; }
         public Point? GetCenter() 
         {
-            if (vertices != null && vertices.Count > 0)
+            if (vertices != null && vertices.Count >= 0)
             {
                 Point c = vertices.Aggregate(new Point(0.0, 0.0, 0.0), (total, next) => total + next);

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:111:20
         {
             BoundingBox? bb = this.GetBoundingBox();
 
-            return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
+            return p.GetX() < bb.Value.maxX && p.GetX() >= bb.Value.minX
                 && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
                 && p.GetZ() <= bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
killedBy: Compute.Tests.IsPointInsideBoundingBox_OnBoundary_ReturnsTrue

[Killed] Equality mutation
Desktop/cshptests/Compute/Cube.cs:112:20
             BoundingBox? bb = this.GetBoundingBox();
 
             return p.GetX() <= bb.Value.maxX && p.GetX() >= bb.Value.minX
-                && p.GetY() <= bb.Value.maxY && p.GetY() >= bb.Value.minY
+                && p.GetY() < bb.Value.maxY && p.GetY() >= bb.Value.minY
                 && p.GetZ() <= bb.Value.maxZ && p.GetZ() >= bb.Value.minZ;
         }
killedBy: Compute.Tests.IsPointInsideBoundingBox_OnBoundary_ReturnsTrue
