[Killed] Arithmetic mutation
Desktop/cshptests/Compute/Point.cs:41:30
         // Distance between two points
         public static double operator %(Point a, Point b)
         {
-            return Math.Sqrt(Math.Pow(b.x - a.x, 2) + Math.Pow(b.y - a.y, 2) + Math.Pow(b.z - a.z, 2));
+            return Math.Sqrt(Math.Pow(b.x - a.x, 2) + Math.Pow(b.y - a.y, 2) - Math.Pow(b.z - a.z, 2));
         }
 
killedBy: Compute.Tests.ComputeDistance_Euclidean_ReturnsCorrectDistance

[NoCoverage] Logical mutation
Desktop/cshptests/Compute/Point.cs:74:20
             if (this.GetType() != other.GetType()) return false;
 
 
-            return (x == other.x) && (y == other.y) && (z == other.z); 
+            return (x == other.x) && (y == other.y) || (z == other.z); 
 
         }
